SET @start_value = @@global.wsrep_black_box_size;
SELECT @start_value;
@start_value
0
SET @@global.wsrep_black_box_size = 420;
ERROR 42000: Variable 'wsrep_black_box_size' can't be set to the value of '420'
SHOW WARNINGS;
Level	Code	Message
Warning	1231	Cannot set 'wsrep_black_box_size' to a value other than 0 because wsrep is switched off.
Error	1231	Variable 'wsrep_black_box_size' can't be set to the value of '420'
SELECT @@global.wsrep_black_box_size;
@@global.wsrep_black_box_size
0
SET @@global.wsrep_black_box_size = 0;
SELECT @@global.wsrep_black_box_size;
@@global.wsrep_black_box_size
0
SET @@session.wsrep_black_box_size = 0;
ERROR HY000: Variable 'wsrep_black_box_size' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@session.wsrep_black_box_size;
ERROR HY000: Variable 'wsrep_black_box_size' is a GLOBAL variable
SET @@global.wsrep_black_box_size = -10;
Warnings:
Warning	1292	Truncated incorrect wsrep_black_box_size value: '-10'
SELECT @@global.wsrep_black_box_size;
@@global.wsrep_black_box_size
0
SET @@global.wsrep_black_box_size = "/foo/bar.txt";
ERROR 42000: Incorrect argument type to variable 'wsrep_black_box_size'
SHOW WARNINGS;
Level	Code	Message
Error	1232	Incorrect argument type to variable 'wsrep_black_box_size'
SELECT @@global.wsrep_black_box_size;
@@global.wsrep_black_box_size
0
SET @@global.wsrep_black_box_size = @start_value;
SELECT @@global.wsrep_black_box_size;
@@global.wsrep_black_box_size
0
